# language: ru
@all
Функция: Добавление продуктов

  Предыстория:
    Дано пользователь открывает страницу добавления продуктов

  @correct
  Структура сценария: Добавление продукта <название>
    Когда пользователь добавляет продукт "<название>" с типом "<тип>" и признаком "<признак>"
    Тогда продукт "<название>" должен быть успешно добавлен

    Примеры:
      | название | тип   | признак        |
      | Перец    | Овощ  | Неэкзотический |
      | Батат    | Овощ  | Экзотический   |
      | Груша    | Фрукт | Неэкзотический |
      | Ананас   | Фрукт | Экзотический   |

  @correct
  Сценарий: Очистка данных
    Когда пользователь очищает данные
    Тогда список продуктов должен быть пустым
